In [392]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import confusion_matrix

In [393]:
test=pd.read_csv('test.csv')
train=pd.read_csv('train.csv')

In [394]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [395]:
print(train.shape)
print(test.shape)

(891, 12)
(418, 11)

In [396]:
print(train.columns)
print(test.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [397]:
lr=train.drop(['Ticket','Cabin','PassengerId'], axis=1)
l=test.drop(['Ticket','Cabin','PassengerId'], axis=1)

print(lr.head())
print(l.head())

   Survived  Pclass                                               Name  \
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

      Sex   Age  SibSp  Parch     Fare Embarked
0    male  22.0      1      0   7.2500        S
1  female  38.0      1      0  71.2833        C
2  female  26.0      0      0   7.9250        S
3  female  35.0      1      0  53.1000        S
4    male  35.0      0      0   8.0500        S
   Pclass                                          Name     Sex   Age  SibSp  \
0       3                              Kelly, Mr. James    male  34.5      0
1       3              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1
2       2                     Myles, Mr. Thomas Francis    male  62.0      0
3       3                              Wirz, Mr. Albert    male  27.0      0
4       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1

   Parch     Fare Embarked
0      0   7.8292        Q
1      0   7.0000        S
2      0   9.6875        Q
3      0   8.6625        S
4      1  12.2875        S

In [398]:
title=set()
for name in train["Name"]:
    title.add(name.split(",")[1].split(".")[0].strip())
print(title)

{'Mr', 'Don', 'Mlle', 'Mme', 'Capt', 'Jonkheer', 'Mrs', 'Rev', 'Sir', 'Miss', 'Ms', 'Major', 'Lady', 'Col', 'the Countess', 'Master', 'Dr'}

In [399]:
titles={'Sir':"officer",'Mme':"normald",'Mr':"norm",'Master':"normald",'Don':"officer",'Miss':"normald",'Lady':"normald",'Mlle':"normald",'Col':"officer",'Ms':"normald",'the Countess':"royal",'Mrs':"normald",'Major':"officer",'Capt':"officer",'Dr':"officer",'Rev':"officer",'Jonkheer':"royal"}

In [400]:
lr["Name"]=lr["Name"].map(lambda name:name.split(",")[1].split(".")[0].strip())
lr["Name"]=lr.Name.map(titles)
lr.head(10)

   Survived  Pclass     Name     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3     norm    male  22.0      1      0   7.2500        S
1         1       1  normald  female  38.0      1      0  71.2833        C
2         1       3  normald  female  26.0      0      0   7.9250        S
3         1       1  normald  female  35.0      1      0  53.1000        S
4         0       3     norm    male  35.0      0      0   8.0500        S
5         0       3     norm    male   NaN      0      0   8.4583        Q
6         0       1     norm    male  54.0      0      0  51.8625        S
7         0       3  normald    male   2.0      3      1  21.0750        S
8         1       3  normald  female  27.0      0      2  11.1333        S
9         1       2  normald  female  14.0      1      0  30.0708        C

In [401]:
l["Name"]=l["Name"].map(lambda name:name.split(",")[1].split(".")[0].strip())
l["Name"]=l.Name.map(titles)
l.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [402]:
print(lr.isna().sum())
print(l.isna().sum())

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64
Pclass       0
Name         1
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     0
dtype: int64

In [403]:
lr.dropna(inplace=True)

In [404]:
print(lr.shape)
print(l.shape)

(712, 9)
(418, 8)

In [405]:
lr.Sex=lr.Sex.map({'female':0,'male':1})
lr.Embarked=lr.Embarked.map({'S':0,'Q':1,'C':2})
lr.Name=lr.Name.map({"royal":0,"normald":1,"officer":2,"norm":3})

l.Sex=l.Sex.map({'female':0,'male':1})
l.Embarked=l.Embarked.map({'S':0,'Q':1,'C':2})
l.Name=l.Name.map({"royal":0,"normald":1,"officer":2,"norm":3})

print(lr.head())
print(l.head())

   Survived  Pclass  Name  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3     3    1  22.0      1      0   7.2500         0
1         1       1     1    0  38.0      1      0  71.2833         2
2         1       3     1    0  26.0      0      0   7.9250         0
3         1       1     1    0  35.0      1      0  53.1000         0
4         0       3     3    1  35.0      0      0   8.0500         0
   Pclass  Name  Sex   Age  SibSp  Parch     Fare  Embarked
0       3   3.0    1  34.5      0      0   7.8292         1
1       3   1.0    0  47.0      1      0   7.0000         0
2       2   3.0    1  62.0      0      0   9.6875         1
3       3   3.0    1  27.0      0      0   8.6625         0
4       3   1.0    0  22.0      1      1  12.2875         0

In [406]:
lr.Age.fillna(lr.Age.median(),inplace=True)
l.Age.fillna(l.Age.median(),inplace=True)
l.Fare.fillna(l.Fare.median(),inplace=True)
l.Name.fillna(l.Name.median(),inplace=True)

In [407]:
lr["Age"]=round((lr.Age.mean()/lr.Age.std()))
l["Age"]=round((l.Age.mean()/l.Age.std()))
l["Fare"]=round((l.Fare.mean()/l.Fare.std()))

In [408]:
print(lr.dtypes)
print(l.dtypes)

Survived      int64
Pclass        int64
Name          int64
Sex           int64
Age           int64
SibSp         int64
Parch         int64
Fare        float64
Embarked      int64
dtype: object
Pclass        int64
Name        float64
Sex           int64
Age           int64
SibSp         int64
Parch         int64
Fare          int64
Embarked      int64
dtype: object

In [409]:
print(lr.isna().sum())
print(l.isna().sum())

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [410]:
X =lr.iloc[:, 1:12].values
y = lr.iloc[:, 0].values

In [411]:
# Resolving the categorical data for training set
label_encoder_sex_tr = LabelEncoder()
label_encoder_title_tr = LabelEncoder()
label_encoder_embarked_tr = LabelEncoder()

In [412]:
X[:, 1] = label_encoder_sex_tr.fit_transform(X[:, 1])
X[:, 5] = label_encoder_title_tr.fit_transform(X[:, 5])
X[:, 4] = label_encoder_embarked_tr.fit_transform(X[:, 4])

In [413]:
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=0)

In [414]:
sc=StandardScaler()

In [415]:
x_train=sc.fit_transform(x_train)
x_test=sc.fit_transform(x_test)

In [416]:
rdmf=RandomForestClassifier(n_estimators=10,criterion='entropy',random_state=0) 
rdmf.fit(x_train,y_train)

RandomForestClassifier(criterion='entropy', n_estimators=10, random_state=0)

In [417]:
print(rdmf.score(x_train,y_train))
print(rdmf.score(x_test,y_test))

0.9156414762741653
0.7762237762237763

In [418]:
titanic_test =l.iloc[:, 0:11].values

In [420]:
titanic_test = sc.fit_transform(titanic_test)
y_pred = rdmf.predict(titanic_test)

In [421]:
y_pred

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1],
      dtype=int64)

In [422]:
len(y_pred)

418

In [423]:
submission=pd.DataFrame({
    "PassengerId":test["PassengerId"],
    "Survived":y_pred
    })
submission.to_csv("submission7_titanic.csv",index=False)